SketchingProperties.defaultProviderName
Access the default UI binding provider name given to all sketches.
Returns: reference to the default UI binding provider name.

SketchingProperties.providerName
access the UI binding provider name for the sketch.
Returns: reference to the UI binding provider name for the sketch.

SketchingProperties.providerName(AString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Set the name of the UI binding provider.
providerName: name of sketching UI binding provider.
Returns: reference to the properties that were updated.